# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

# *Пример*

# - при [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]     ->        [2, 4, 5, 9]

nums = [1, 1, 2, 3, 3, 4, 1, 5, 7, 8, 8, 7, 9]
print(nums)
new_nums = []
for i in nums:
    if nums.count(i) > 1:
        continue
    else:
        new_nums.append(i)
print(new_nums)